<template>
    <section id="details" class="about-section">
        <div class="about-content fade-up">
            <h1>Обо мне</h1>
            <p>
                <strong class="strong">Unity-разработчик</strong>
                с более чем двухлетним опытом в разработке VR и 3D приложений. 
                Начинал как разработчик, затем перешёл на позицию тимлида. 
                В рамках этой роли координировал работу команды из 7 человек: 
                разбивал и планировал задачи, контролировал сроки и качество реализации, вёл задачи через Redmine.
            </p>
            <p>
                <strong class="strong">Регулярно</strong>
                проводил code review, администрировал репозитории в GitLab, поддерживал рабочие процессы. Взаимодействовал с заказчиками: помогал уточнять требования, формировал техническое видение и предлагал оптимальные решения.
                <br><strong class="strong">Отличаюсь</strong>
                системным мышлением, ответственным подходом и способностью доводить проект до стабильного, качественного релиза.
            </p>

            <h2>Навыки</h2>
            <ul class="skills-list decimal">
                <li><strong>Разработка на Unity и 3D-технологии</strong>
                    <p>
                        Настройка визуала и окружения (UI, URP/HDRP, Shader Graph, HLSL, Cinemachine, FMOD).
                        <br/>Построение архитектуры проекта (MVC, Zenject, Master-скрипты, Service Locator). 
                        <br/>Динамическая загрузка контента (Addressables, Asset Bundles). 
                        <br/>птимизация под различные платформы и отладка (Visual Studio, Unity Profiler).
                    </p>
                </li>
                <li><strong>Кроссплатформенная разработка и XR</strong>
                    <p>
                        Разработка под Oculus, OpenXR и 3D-платформы.
                    </p>
                </li>
                <li><strong>Сетевые технологии</strong>
                    <p>
                        Мультиплеер (Mirror), REST API, работа с данными (JSON, ScriptableObject).
                    </p>
                </li>
                <li><strong>Поддержка сетевой инфраструктуры</strong>
                    <p>
                        Настройка сервера, и развертывание Docker-контейнеров. 
                        <br/>Настройка Gitlab, Nextcloud и внедрение CI/CD для автоматической сборки и размещения Unity проектов.
                        <br/>Развертывание веб-сайтов (на одном из которых вы сейчас находитесь 😉).
                    </p>
                </li>
                <li><strong>Рабочие процессы</strong><p>Работа с Git (GitLab, Fork, Sourcetree). Управление задачами через Redmine.</p></li>
            </ul>

            <div class="education">
                <h2>Образование — Магистр (2027)</h2>
                <p>Уфимский университет науки и технологий | Институт информатики, математики и робототехники <br>
                    <strong>Математическое обеспечение и администрирование информационных систем<br>
                        (Математик-программист)</strong>
                </p>
            </div>

            <h2>Контакты — Глеб Панченко</h2>
            <ul class="contact-list">
                <li><strong>Телефон:</strong> <a href="tel:+79191516697">+7 (919) 151-66-97</a></li>
                <li><strong>Город:</strong> Уфа</li>
                <li><strong>Гражданство:</strong> Россия (готов к переездам и командировкам)</li>
            </ul>
                        <div class="link-group">
                <a href="mailto:work.pgv28@gmail.com">
                    <svg
                        class="icon"
                        viewBox="0 0 64 64"
                        aria-hidden="true"
                    >
                    <circle cx="32" cy="32" r="32" />
                    <g class="st1">
                        <path class="st2" d="M52,44c0,2.2-1.8,4-4,4H16c-2.2,0-4-1.8-4-4V24c0-2.2,1.8-4,4-4h32c2.2,0,4,1.8,4,4V44z"/>
                    </g>
                    <g>
                        <path class="st3" d="M52,42c0,2.2-1.8,4-4,4H16c-2.2,0-4-1.8-4-4V22c0-2.2,1.8-4,4-4h32c2.2,0,4,1.8,4,4V42z"/>
                    </g>
                    <g class="st1">
                        <g>
                            <path class="st2" d="M35.5,30.2c-1.9-2.1-5.1-2.1-7,0L13,43.2c-0.2,0.2-0.3,0.4-0.5,0.6c0.7,1.3,2,2.2,3.4,2.2h32
                                c1.5,0,2.7-0.9,3.4-2.2c-0.1-0.2-0.3-0.4-0.5-0.6L35.5,30.2z"/>
                        </g>
                    </g>
                    <g>
                        <g>
                            <path class="st3" d="M35.5,32c-1.9-1.9-5.1-1.9-7,0L13,43.5c-0.2,0.2-0.3,0.3-0.5,0.5c0.7,1.2,2,1.9,3.4,1.9h32
                                c1.5,0,2.7-0.8,3.4-1.9c-0.1-0.2-0.3-0.3-0.5-0.5L35.5,32z"/>
                        </g>
                    </g>
                    <g class="st1">
                        <g>
                            <path class="st2" d="M12.6,20.2c0.7-1.3,2-2.2,3.4-2.2h32c1.5,0,2.7,0.9,3.4,2.2c-0.1,0.2-0.3,0.4-0.5,0.6l-15.4,13
                                c-1.9,2.1-5.1,2.1-7,0L12.6,20.2z"/>
                        </g>
                    </g>
                    <g>
                        <g>
                            <path class="st4" d="M28.5,32c1.9,1.9,5.1,1.9,7,0L51,20.5c0.2-0.2,0.3-0.3,0.5-0.5c-0.7-1.2-2-1.9-3.4-1.9H16
                                c-1.5,0-2.7,0.8-3.4,1.9c0.1,0.2,0.3,0.3,0.5,0.5L28.5,32z"/>
                        </g>
                    </g>
                    </svg>
                    work.pgv28@gmail.com
                </a>
                <a href="https://t.me/pgv_work" target="_blank">
                    <svg
                        class="icon"
                        viewBox="0 0 512 512"
                        aria-hidden="true"
                    >
                    <circle cx="256" cy="256" r="256"/>
                    <path style="fill:#0606064e;" d="M511.924,250.077L398.283,136.625l-185.108,225.63l133.284,133.284
                        C443.197,458.988,512,365.535,512,256C512,254.019,511.969,252.045,511.924,250.077z"/>
                    <path style="fill:#FFFFFF;" d="M383.717,133.52c10.206-3.982,20.756,4.948,18.515,15.67l-45.77,218.781
                        c-2.138,10.257-14.188,14.877-22.635,8.671l-69.094-50.717l-35.219,35.961c-6.189,6.31-16.86,3.741-19.515-4.672l-25.41-80.662
                        l-68.112-20.118c-8.947-2.638-9.464-15.084-0.793-18.48L383.717,133.52z M350.118,182.065c2.982-2.638-0.483-7.292-3.862-5.189
                        l-147.015,91.177c-2.586,1.603-3.775,4.758-2.862,7.671l20.049,88.04c0.397,1.345,2.327,1.155,2.5-0.241l4.482-67.094
                        c0.172-1.655,0.965-3.172,2.207-4.275L350.118,182.065z"/>
                    <path style="fill:#9EC2E5;" d="M346.257,176.876c3.379-2.103,6.844,2.551,3.862,5.189l-124.5,110.089
                        c-1.241,1.103-2.034,2.62-2.207,4.275l-4.482,67.094c-0.172,1.396-2.103,1.586-2.5,0.241l-20.049-88.04
                        c-0.914-2.913,0.276-6.068,2.862-7.671L346.257,176.876z"/>
                    <path style="fill:#FFFFFF;" d="M217.154,364.678c-3.241-1.155-5.982-3.741-7.154-7.465l-25.41-80.662l-68.112-20.118
                        c-8.947-2.638-9.464-15.084-0.793-18.48L383.717,133.52c6.585-2.569,13.326,0.241,16.653,5.448
                        c-0.621-0.948-1.362-1.827-2.189-2.603L216.343,284.81v6.499l-1-0.724l1,40.926v32.823c0.259,0.121,0.534,0.224,0.81,0.31V364.678
                        L217.154,364.678z"/>
                    <g>
                        <path style="fill:#D1D1D1;" d="M402.525,145.518c0.052,1.172-0.034,2.413-0.293,3.672l-45.77,218.781
                            c-2.138,10.257-14.188,14.877-22.635,8.671l-69.094-50.717l-48.39-34.616v-6.499l181.838-148.446
                            c0.827,0.776,1.569,1.655,2.189,2.603c0.121,0.207,0.241,0.396,0.362,0.586c0.103,0.207,0.224,0.414,0.328,0.603
                            c0.103,0.207,0.207,0.414,0.293,0.621c0.103,0.224,0.19,0.431,0.276,0.655c0.069,0.19,0.155,0.396,0.224,0.621
                            c0.224,0.672,0.396,1.362,0.517,2.086C402.439,144.587,402.491,145.036,402.525,145.518z"/>
                        <path style="fill:#D1D1D1;" d="M264.733,325.925l-35.219,35.961c-0.293,0.293-0.603,0.586-0.914,0.845
                            c-0.31,0.259-0.621,0.483-0.948,0.707c-0.017,0.017-0.017,0.017-0.017,0.017c-0.655,0.431-1.327,0.793-2.034,1.086
                            c-0.362,0.138-0.707,0.276-1.069,0.362c-1.5,0.448-3.034,0.569-4.551,0.414c-0.396-0.034-0.793-0.103-1.172-0.172
                            c-0.052,0-0.103-0.017-0.155-0.034c-0.379-0.103-0.759-0.207-1.138-0.328c-0.121-0.034-0.241-0.069-0.362-0.138l-0.81-33.133
                            v-40.202L264.733,325.925z"/>
                    </g>
                    <g>
                        <path style="fill:#DADDE0;" d="M228.6,362.73c-0.31,0.259-0.621,0.5-0.948,0.724v-0.017
                            C227.98,363.213,228.29,362.989,228.6,362.73z"/>
                        <path style="fill:#DADDE0;" d="M227.652,363.437v0.017c0,0,0-0.017-0.017,0C227.635,363.454,227.635,363.454,227.652,363.437z"/>
                        <path style="fill:#DADDE0;" d="M225.601,364.541c0.707-0.293,1.379-0.655,2.034-1.086
                            C226.98,363.885,226.29,364.247,225.601,364.541z"/>
                        <path style="fill:#DADDE0;" d="M219.981,365.316c1.517,0.155,3.051,0.034,4.551-0.414c-1.086,0.345-2.207,0.5-3.327,0.5
                            c-0.345,0-0.69-0.017-1.017-0.052C220.119,365.351,220.05,365.351,219.981,365.316z"/>
                    </g>
                    <g>
                        <path style="fill:#FFFFFF;" d="M221.205,365.402c-0.345,0-0.69-0.017-1.017-0.052C220.515,365.385,220.86,365.402,221.205,365.402z
                            "/>
                        <path style="fill:#FFFFFF;" d="M219.981,365.316c0.069,0.034,0.138,0.034,0.207,0.034c-0.362-0.017-0.69-0.069-1.034-0.138
                            C219.429,365.265,219.705,365.299,219.981,365.316z"/>
                    </g>
                    <g>
                        <path style="fill:#DADDE0;" d="M219.981,365.316c-0.276-0.017-0.552-0.052-0.827-0.103c-0.121-0.017-0.241-0.034-0.345-0.069
                            C219.188,365.213,219.584,365.282,219.981,365.316z"/>
                        <path style="fill:#DADDE0;" d="M217.516,364.782c0.379,0.121,0.759,0.224,1.138,0.328c-0.155-0.034-0.31-0.069-0.465-0.103
                            c-0.069-0.017-0.138-0.034-0.19-0.069C217.843,364.903,217.671,364.851,217.516,364.782z"/>
                    </g>
                    <g>
                        <path style="fill:#FFFFFF;" d="M218.188,365.006c0.155,0.034,0.31,0.069,0.465,0.103
                            C218.498,365.092,218.343,365.058,218.188,365.006z"/>
                        <path style="fill:#FFFFFF;" d="M217.516,364.782c0.155,0.069,0.328,0.121,0.483,0.155c-0.259-0.052-0.517-0.138-0.776-0.241
                            C217.326,364.73,217.412,364.765,217.516,364.782z"/>
                    </g>
                    <path style="fill:#DADDE0;" d="M217.516,364.782c-0.103-0.017-0.19-0.052-0.293-0.086c-0.017,0.017-0.052,0-0.069-0.017v-0.034
                        C217.274,364.713,217.395,364.747,217.516,364.782z"/>
                    <path style="fill:#D1D1D1;" d="M216.343,331.511l0.81,33.133c-0.276-0.086-0.552-0.19-0.81-0.31V331.511z"/>
                    <polygon style="fill:#DADDE0;" points="216.343,291.309 216.343,331.511 215.343,290.585 "/>
                    <path style="fill:#ADBCC9;" d="M350.118,182.065l-124.5,110.089c-1.241,1.103-2.034,2.62-2.207,4.275l-4.474,67.1
                        c-0.172,1.396-2.103,1.586-2.517,0.241l-20.04-88.045c-0.914-2.913,0.276-6.068,2.862-7.671l147.015-91.177
                        C349.636,174.773,353.101,179.428,350.118,182.065z"/>
                    </svg>
                    Telegram
                </a>
                <a href="/assets/resume.pdf" download="Gleb_Panchenko_Resume.pdf">
                    <svg
                        class="icon icon-elegant"
                        viewBox="0 0 64 64"
                        aria-hidden="true"
                    >
                        <g>
                        <g>
                            <circle cx="32" cy="32" r="32"/>
                        </g>
                        <g class="st1">
                            <g>
                            <path class="st2" d="M40,11.2C40,11.2,40,11.1,40,11.2C40,11,40,11,40,11.2z"/>
                            </g>
                            <g>
                            <path class="st2" d="M24,11.1C24,11.1,24,11.2,24,11.1C24,11,24,11,24,11.1z"/>
                            </g>
                        </g>
                        <g>
                            <g class="st1">
                            <path class="st2" d="M48,32c0-6.5-3.8-12-9.4-14.5C36.9,16.7,36,18,36,19.1v8.5c0,0.8,0.7,1.4,1.5,1.4h3.1c1.5,0,1.9,1.1,0.9,2.4l-7.7,9.8c-1,1.2-2.6,1.2-3.5,0l-7.7-9.8c-1-1.2-0.6-2.4,0.9-2.4h3.1c0.8,0,1.5-0.6,1.5-1.4v-8.5c0-1.1-1.5-2.1-2.8-1.6c-4.3,2-7.6,5.9-8.7,10.6C11.7,28.9,8,33,8,38c0,5.5,4.5,10,10,10h30c4.4,0,8-3.6,8-8S52.4,32,48,32z"/>
                            </g>
                            <g>
                            <path class="st4" d="M48,30c0-6.5-3.8-12-9.4-14.5C36.9,14.7,36,16,36,17.1v8.5c0,0.8,0.7,1.4,1.5,1.4h3.1c1.5,0,1.9,1.1,0.9,2.4l-7.7,9.8c-1,1.2-2.6,1.2-3.5,0l-7.7-9.8c-1-1.2-0.6-2.4,0.9-2.4h3.1c0.8,0,1.5-0.6,1.5-1.4v-8.5c0-1.1-1.5-2.1-2.8-1.6c-4.3,2-7.6,5.9-8.7,10.6C11.7,26.9,8,31,8,36c0,5.5,4.5,10,10,10h30c4.4,0,8-3.6,8-8S52.4,30,48,30z"/>
                            </g>
                            <g>
                            <path class="st4" d="M40,9.2C40,9.2,40,9.1,40,9.2C40,9,40,9,40,9.2z"/>
                            </g>
                            <g>
                            <path class="st4" d="M24,9.1C24,9.1,24,9.2,24,9.1C24,9,24,9,24,9.1z"/>
                            </g>
                        </g>
                        </g>
                    </svg>
                    Скачать резюме
                </a>
            </div>
        </div>
    </section>
</template>


<style scoped>
.about-section {
    min-height: 100vh;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    padding: 60px 20px;
    color: #222;
}

.about-content {
    max-width: 800px;
    margin: 0 auto;
    padding: 60px 20px;
}

.about-section h1 {
    font-size: 2rem;
    margin-bottom: 1rem;
}

.about-section h2 {
    margin-top: 1rem;
    margin-bottom: 1rem;
    border-top: 1px solid #ccc;
    padding-top: 1rem;
}

.about-section p {
    font-family: "Exo 2";
    font-weight: 600;
    font-size: 1rem;
    line-height: 1.6;
    margin-bottom: .5rem;
}

.strong {
    margin: 0.3rem 0;
    color: #8fbc83;
}

.skills-list {
    list-style: decimal;
    margin: 1rem;
}
.contact-list {
    list-style: none;
    padding: 0;
    margin: 1rem 0;
}

.skills-list li,
.contact-list li {
    margin-bottom: 0.5rem;
    font-family: "Exo 2";
    font-weight: 600;
}

.contact-list a {
    font-family: "Exo 2";
    font-weight: 600;
    color: #8fbc83;
    text-decoration: underline;
}

.link-group {
    display: flex;
    align-items: center;
    gap: .75rem;
    flex-wrap: wrap;
    justify-content: flex-start;
    margin-bottom: 1rem;
}

.link-group a {
    display: inline-flex;
    align-items: center;
    color: #8fbc83;
    text-decoration: none;
    transition: color .2s;
}

.link-group a:hover {
    color: #444;
}

.icon {
    width: 24px;
    height: 24px;
    fill: currentColor;
    margin-right: .4rem;
    flex-shrink: 0;
}
.st0{fill:#8fbc83;}
.st1{opacity:.2;}
.st2{fill:#231F20;}
.st3{fill:#E0E0D1;}
.st4{fill:#FFFFFF;}
</style>